<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"2b5625245f49e374ecc30f2385337be219fe519a066366fb514c5eb106a8ba10","plan_job_ref":"Job Terraform Plan #25 at https://github.com/cal-itp/cal-bc/actions/runs/18611909711","plan_out_hash":"74cdada5b54320a19b7f63dc70f1f41697eb80de03453bbdb7df50379489c2b8","plan_hash":"8a5ac01a387aca448c3da4e0d92bbfb03a91f4a2793868510a3962154932e16e","plan_text_format":"diff","version":"2.2.2","closed":true} -->
Terraform plan in __iac/__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.cloud-run.google_cloud_run_service.main will be created
+   resource "google_cloud_run_service" "main" {
+       autogenerate_revision_name = true
+       id                         = (known after apply)
+       location                   = "us-west2"
+       name                       = "cal-bc-staging"
+       project                    = "cal-itp-data-infra-staging"
+       status                     = (known after apply)

+       metadata {
+           annotations           = {
+               "run.googleapis.com/ingress" = "all"
            }
+           effective_annotations = {
+               "run.googleapis.com/ingress" = "all"
            }
+           effective_labels      = {
+               "goog-terraform-provisioned" = "true"
            }
+           generation            = 0
+           namespace             = (known after apply)
+           resource_version      = (known after apply)
+           self_link             = (known after apply)
+           terraform_labels      = {
+               "goog-terraform-provisioned" = "true"
            }
+           uid                   = (known after apply)
        }

+       template {
+           metadata {
+               annotations      = {
+                   "autoscaling.knative.dev/maxScale" = "2"
+                   "autoscaling.knative.dev/minScale" = "1"
+                   "generated-by"                     = "terraform"
+                   "run.googleapis.com/client-name"   = "terraform"
                }
+               generation       = (known after apply)
+               labels           = (known after apply)
+               name             = (known after apply)
+               namespace        = (known after apply)
+               resource_version = (known after apply)
+               self_link        = (known after apply)
+               uid              = (known after apply)
            }
+           spec {
+               container_concurrency = (known after apply)
+               service_account_name  = "composer-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com"
+               serving_state         = (known after apply)
+               timeout_seconds       = 120

+               containers {
+                   args    = []
+                   command = []
+                   image   = "ghcr.io/cal-itp/cal-bc/cal-bc:development"
+                   name    = (known after apply)

+                   env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
+                   env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }

+                   ports {
+                       container_port = 8080
+                       name           = "http1"
                    }

+                   resources {
+                       limits = (known after apply)
                    }

+                   startup_probe (known after apply)
                }
            }
        }

+       traffic {
+           latest_revision = true
+           percent         = 100
+           url             = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform Apply #5](https://github.com/cal-itp/cal-bc/actions/runs/18611939596)